#### Importing libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

#### Loading dataset

In [2]:
dataframe=pd.read_csv('Dataset_unsupervised.csv')

#### Checking whether ther's a missing value or not

In [7]:
dataframe.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [5]:
dataframe.isna().head()

   CustomerID  Genre    Age  Annual Income (k$)  Spending Score (1-100)
0       False  False  False               False                   False
1       False  False  False               False                   False
2       False  False  False               False                   False
3       False  False  False               False                   False
4       False  False  False               False                   False

Counting how many non values are there's in the dataset

In [8]:
dataframe.isna().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

Inserting non values

In [9]:
dataframe.iloc[[0,1,2],[3]]=np.nan

non values inserted successfully

In [11]:
dataframe.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                 NaN                      39
1           2    Male   21                 NaN                      81
2           3  Female   20                 NaN                       6
3           4  Female   23                16.0                      77
4           5  Female   31                17.0                      40

In [12]:
dataframe.isna().head()

   CustomerID  Genre    Age  Annual Income (k$)  Spending Score (1-100)
0       False  False  False                True                   False
1       False  False  False                True                   False
2       False  False  False                True                   False
3       False  False  False               False                   False
4       False  False  False               False                   False

Dropping non values from the dataset

In [13]:
dataframe.dropna().head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
3           4  Female   23                16.0                      77
4           5  Female   31                17.0                      40
5           6  Female   22                17.0                      76
6           7  Female   35                18.0                       6
7           8  Female   23                18.0                      94

In [14]:
salman=dataframe.dropna()

In [15]:
salman.head()
# dataframe.tail()
print(type(salman))

<class 'pandas.core.frame.DataFrame'>

taking entire dataset in a new variable

In [18]:
faizi=salman
faizi
print(type(faizi))
faizi.head()
faizi.tail()

<class 'pandas.core.frame.DataFrame'>

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35               120.0                      79
196         197  Female   45               126.0                      28
197         198    Male   32                 NaN                      74
198         199    Male   32                 NaN                      18
199         200    Male   30                 NaN                      83

Again inserting non values in dataset

In [19]:
faizi.iloc[[-1,-2,-3],3]=np.nan

C:\Users\salma\anaconda3\lib\site-packages\pandas\core\indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

In [22]:
faizi.iloc[:,:].tail()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35               120.0                      79
196         197  Female   45               126.0                      28
197         198    Male   32                 NaN                      74
198         199    Male   32                 NaN                      18
199         200    Male   30                 NaN                      83

Showing non values

faizi.iloc[:,-2]

Taking mean of the perticular column to inset that inplace of non values

In [23]:
faizi1=faizi.iloc[:,-2]
np.mean(faizi1)
# faizi.head()

60.134020618556704

Filling mean value inplace  to the non values

In [24]:
faizi["Annual Income (k$)"].fillna(np.mean(faizi1),inplace=True)

C:\Users\salma\anaconda3\lib\site-packages\pandas\core\series.py:4463: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

values filled succesfully

In [26]:
faizi.tail()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35          120.000000                      79
196         197  Female   45          126.000000                      28
197         198    Male   32           60.134021                      74
198         199    Male   32           60.134021                      18
199         200    Male   30           60.134021                      83

Examining correlation between features

In [27]:
import seaborn as sns
sal=faizi.corr()
sal

,CustomerID,Age,Annual Income (k$),Spending Score (1-100)
CustomerID,1.000000,-0.064239,0.963096,0.005873
Age,-0.064239,1.000000,-0.027011,-0.343078
Annual Income (k$),0.963096,-0.027011,1.000000,-0.010993
Spending Score (1-100),0.005873,-0.343078,-0.010993,1.000000

The correlation between customer id column and Annual income are approx 1 so we can drop any of them

In [28]:
new_dataset=faizi.drop(['CustomerID'],axis=1)

Customer column dropped successfully

In [29]:
new_dataset.head()

    Genre  Age  Annual Income (k$)  Spending Score (1-100)
3  Female   23                16.0                      77
4  Female   31                17.0                      40
5  Female   22                17.0                      76
6  Female   35                18.0                       6
7  Female   23                18.0                      94

OneHotEncoding of the categorial column

In [35]:
from sklearn.preprocessing import OneHotEncoder
one_hot_encoding=OneHotEncoder()
x=one_hot_encoding.fit_transform((faizi.Genre.values.reshape(-1,1))).toarray()
print(x)

[[1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]
 [0. 1.]
 [0. 1.]]

In [36]:
faizi.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
3           4  Female   23                16.0                      77
4           5  Female   31                17.0                      40
5           6  Female   22                17.0                      76
6           7  Female   35                18.0                       6
7           8  Female   23                18.0                      94